# DBeam_Begin

## Description
start drawing beam routine

```pascal
PROCEDURE DBeam_Begin;
```

```python
def vs.DBeam_Begin():
    return None
```

## Examples
```pascal
DBeam_Begin;
```
```python
import vs

# start drawing beam routine.
vs.DBeam_Begin()
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight